# <font face="times"><font size="6pt"><p style = 'text-align: center;'> The City University of New York, Queens College

<font face="times"><font size="6pt"><p style = 'text-align: center;'><b>Introduction to Computational Social Science</b><br/><br/>

<p style = 'text-align: center;'><font face="times"><b>Lesson 05 | SQL Databases and Multiprocessing </b><br/><br/>


<p style = 'text-align: center;'><font face="times"><b>9 Checkpoints</b><br/><br/>

***
# Begin Lesson 05
(Source: https://medium.com/analytics-vidhya/programming-with-databases-in-python-using-sqlite-4cecbef51ab9) 
(Source: https://medium.com/@urban_institute/using-multiprocessing-to-make-python-code-faster-23ea5ef996ba)

If you are aspiring to be a data/computational social scientist, you are going to be working with a lot of data! 

Much of the data reside in databases. Thus, you should be comfortable accessing data from databases through queries and then working on them to find key insights.

***
***

Many forms of data exist in databases. From the number of passengers in an airport to the count of stationary in a bookshop, everything is recorded today in form of digital files called **databases**. 

However, databases are nothing more than electronic lists of information. 

Some databases are simple, and designed for smaller tasks while others are powerful, and designed for big data. 

All of them, however, have the same commonalities and perform a similar function. 

Different database tools store that information in unique ways. 
    - Flat files use a table.
    - SQL databases use a relational model
    - NoSQL databases use a key-value model.

Here, we focus only on the **Relational Databases** and accessing them in Python. 

We will begin by having a quick overview of the Relational databases and their important constituents.

***
***

# Relational Databases

A Relational database consists of one or more tables of information. The rows in the table are called **records** and the columns in the table are called **fields** or **attributes**. 

A database that contains **TWO or more related tables** is called a **relational database** 

The main idea behind a relational database is that your data gets broken down into common themes, with one table dedicated to describing the records of each theme.

***

## Database tables
Each table in a relational database has one or more columns, and each column is assigned a specific data type, such as an integer number, a sequence of characters (for text), or a date. Each row in the table has a value for each column.
A typical fragment of a table containing employee information may look as follows:

![Database](Images/05_relationaldbexample.png)

The tables of a relational database have some important characteristics:
    - There is no significance to the order of the columns or rows.
    - Each row contains one and only one value for each column.
    - Each value for a given column has the same type.

Each table in the database should hold information about **ONE SPECIFIC** thing only, such as employees, products, or customers.

By designing a database this way, it helps to eliminate redundancy and inconsistencies. 

For example, both the sales and accounts payable departments may look up information about customers. In a relational database, the information about customers is entered **only once** in a table that both departments can access.

***
***

## Primary and Foreign Keys

We know that a relational database is a set of related tables. We use **primary and foreign keys** to describe relationships between the information in different tables. In other words, primary and foreign keys define the relational structure of a database. 

These keys enable each row in the database tables to be identified and define the relationships between the tables.

![Database](Images/05_relationaldbexample2.png)

#### Primary Key
The primary key of a relational table uniquely identifies each record in the table. It is a **column**, or set of columns, that allows **each row in the table to be uniquely identified**. No two rows in a table with a primary key can have the same primary key value.

In other words, imagine you have a **CUSTOMERS** table that contains a record for each customer visiting a store. The customer’s unique number is a good choice for a **primary key**. The customer’s first and last name **are not good** choices because there is always the chance that more than one customer might have the same name.

#### Foreign Key
A foreign key is a field in a relational table that matches the **primary key column of another table**.

The example above gives a good idea of the primary and foreign keys.

***
***

# Database Management Systems and SQL

The **Database management system (DBMS)** is the software that interacts with end users, applications, and the database itself to capture and analyze data. 

The DBMS used for **relational databases** is called Relational Database Management Systems (RDBMS). 

Most commercial RDBMSes use **Structured Query Language (SQL)**, a declarative language for manipulating data, to access the database. The major RDBMS are 
    - Oracle
    - MySQL
    - Microsoft SQL Server 
    - PostgreSQL
    - Microsoft Access
    - SQLite

Databases are the focus and concern of data engineers, but we need to be familiar how they are set up and (more importantly) how to query from them. 

We will focus on using `Python` to access relational databases using a very easy to use database engine called `SQLite`. It is a relational database management system based on the SQL language but optimized for use in small environments such as mobile phones or small applications. It is self-contained, serverless, zero-configuration and transactional. It is very fast and lightweight, and the entire database is stored in a single disk file. `SQLite` is built for simplicity and speed compared to a hosted client-server relational database such as `MySQL`. It sacrifices sophistication for utility and complexity for size. 

However, queries in `SQLite` are almost identical to other `SQL` calls, so if you know one version of `SQL`, you essentially know them all. 


`SQLite` can be integrated with `Python` using a  module called `sqlite3`.

In [1]:
import sqlite3

The first thing to keep in mind is that we have to import _driver_ code - that is the API for the specific database that we want to use. The most common are:

- [psycopg2](http://initd.org/psycopg/)
- [MySQL Connector/Python](http://dev.mysql.com/doc/connector-python/en/)
- [sqlite3](https://docs.python.org/2/library/sqlite3.html)

Though a host of other databases for vendors like IBM, Microsoft, and Oracle can be found at [Python Database Interfaces](https://wiki.python.org/moin/DatabaseInterfaces). 

In this tutorial we will be using `sqlite3` because it ships with Python (the other drivers are third party) and because it is so simple to use. SQLite databases are the embedded backbone of many applications, though they should be kept small. 

## Connecting to a Database

The first thing you have to do is make a connection to a database. Often times this means you'll need the following information to connect to a database server:

- hostname
- port 
- username
- password
- database name

SQLite is an _embedded_ database, however - which means it is stored in a file on disk, and operated on soley by a single program (not multiple programs at once). Therefore in order to create a connection to a SQLite database, we simply need to point it to a file on disk.

In [2]:
DBPATH = 'Data/people.db'
conn = sqlite3.connect(DBPATH)

At this point, you should notice that a file called `people.db` has been created in your `Data/` folder! 

Let's check it out! Let's `cd` into `Data` (don't forget to add the `/` after `Data`) and list out the files. You should see `people.db` listed at the very bottom, and it should be empty.

In [3]:
%cd Data/
%ls -ltr

/home/ahegu/Class_Materials/Data
total 84576
drwxr-xr-x 2 ahegu   registered_users     4096 Oct  3 21:49 git_web_ml/
-rw-rw-r-- 1 ahegu   registered_users  2396031 Oct 14 20:17 git_web_ml.zip
-rwxrwxr-x 1 ahegu   registered_users    11420 Feb  1 01:22 CSV_FOR_SESSION03.csv*
drwxrwxr-x 2 ahegu   registered_users     4096 Feb  1 01:22 Excel_MID/
-rwxrwxr-x 1 ahegu   registered_users    17509 Feb  1 01:22 GDP_2015.csv*
-rwxrwxr-x 1 ahegu   registered_users    18078 Feb  1 01:22 GDP_2016.csv*
-rwxrwxr-x 1 ahegu   registered_users    21434 Feb  1 01:22 GDP_2017.csv*
-rw-rw-r-- 1 ahegu   registered_users       65 Feb  1 01:22 G_Edgelist.txt
-rwxrwxr-x 1 ahegu   registered_users 69802443 Feb  1 01:22 New_York_Times_SF_All.csv*
-rwxrwxr-x 1 ahegu   registered_users   564244 Feb  1 01:22 android_devices.csv*
-rwxrwxr-x 1 ahegu   registered_users   678586 Feb  1 01:22 articles_bbc_2018_01_30.csv*
-rwxrwxr-x 1 ahegu   registered_users     8767 Feb  1 01:22 baseball.csv*
-rwxrwxr-x 1 ahegu   registered_users   854362 Feb  1 01:22 facebook_combined.txt*
-rw-rw-r-- 1 ahegu   registered_users     2310 Feb  1 01:22 fruit_data_with_colors.txt
-rw-rw-r-- 1 ahegu   registered_users     8026 Feb  1 01:22 gapminder_gdp_africa.csv
-rw-rw-r-- 1 ahegu   registered_users     4134 Feb  1 01:22 gapminder_gdp_americas.csv
-rw-rw-r-- 1 ahegu   registered_users     5015 Feb  1 01:22 gapminder_gdp_asia.csv
-rw-rw-r-- 1 ahegu   registered_users     4659 Feb  1 01:22 gapminder_gdp_europe.csv
-rw-rw-r-- 1 ahegu   registered_users      375 Feb  1 01:22 gapminder_gdp_oceania.csv
-rwxrwxr-x 1 ahegu   registered_users     2672 Feb  1 01:22 hartford_drug.txt*
-rw-rw-r-- 1 ahegu   registered_users  4494867 Feb  1 01:22 higgsboson.csv
-rw-rw-r-- 1 ahegu   registered_users    31250 Feb  1 01:22 mediause.csv
-rw-rw-r-- 1 ahegu   registered_users     1686 Feb  1 01:22 microbiome.csv
-rw-rw-r-- 1 ahegu   registered_users     1685 Feb  1 01:22 microbiome_missing.csv
-rw-rw-r-- 1 ahegu   registered_users     1017 Feb  1 01:22 star-wars-network-edges-without-headers.csv
-rw-rw-r-- 1 ahegu   registered_users     1226 Feb  1 01:22 star-wars-network-edges.csv
-rw-rw-r-- 1 ahegu   registered_users    36997 Feb  1 01:22 starwars_net.json
-rwxrwxr-x 1 ahegu   registered_users     5120 Feb  1 01:22 superheroes.db*
-rw-rw-r-- 1 ahegu   registered_users   289792 Feb  1 01:22 titanic.xls
-rw-rw-r-- 1 ahegu   registered_users    59861 Feb  1 01:22 titanic_characteristics.csv
-rw-rw-r-- 1 ahegu   registered_users     6149 Feb  1 01:22 titanic_survived.csv
-rw-rw-r-- 1 ahegu   registered_users    10782 Feb  1 01:22 wine_data.csv
-rwxrwxr-x 1 cjgomez registered_users    11420 Feb 25 01:12 Country_IDVs.csv*
-rwxrwxr-x 1 ahegu   registered_users     8955 Feb 25 03:05 user_usage.csv*
-rwxrwxr-x 1 ahegu   registered_users     9962 Feb 25 03:05 user_device.csv*
-rw-rw-r-- 1 ahegu   registered_users    26886 Feb 27 18:08 mb_test.csv
-rw-rw-r-- 1 ahegu   registered_users    27445 Feb 27 18:08 mb_test_pickle
-rw-rw-r-- 1 ahegu   registered_users     1225 Feb 27 18:08 data_chunks_pickle
-rw-rw-r-- 1 ahegu   registered_users  7077973 Mar  5 04:34 AB_NYC_2019.csv
-rw-r--r-- 1 ahegu   registered_users     7168 Mar  5 17:56 people.db

Okay, let's go back to our original working directory and double-check that we're not in `Data` anymore.

In [4]:
%cd ..
%pwd

/home/ahegu/Class_Materials

'/home/ahegu/Class_Materials'

Okay, now that we've created an (empty) database, let's get to work. 

First, the `connect` method returns a connection object that we've called `conn`. With `conn` you can manipulate your connection to the database including the following methods:

- `conn.commit()` - commit any changes back to the database
- `conn.close()` - close our connection to the database and tidy up

However, to execute SQL against the database to `INSERT` or `SELECT` rows, we'll need to create a cursor:

In [5]:
cursor = conn.cursor()

A cursor is essentially a pointer into the database. Think of it like a mouse cursor that keeps track of where you are on in the database table or tables. Cursors have the following methods:

- `cursor.execute()` - executes a SQL string against the database
- `cursor.fetchone()` - fetch a single row back from the executed query
- `cursor.fetchall()` - fetch all results back from the executed query. 

Together, connections and cursors are the basic way to interact with a SQL database.

***
***

## Describing the Database

The first thing we have to do is describe the type of data that we'll be putting in the database by creating a _schema_. For this workshop, we'll be creating a very simple contacts application, our schema is as follows:

![Contacts Schema](Images/05_schema.png)

Here we have two tables, `contacts` which keeps track of people, their email, and who they are affiliated with, and `companies` which keeps tracks of organizations. To create the companies table we would execute SQL as follows:

In [6]:
sql =   '''
        CREATE TABLE IF NOT EXISTS companies (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT NOT NULL)
        '''

In [7]:
cursor.execute(sql)

A note on the syntax above - since I like to write clean, well-indented `SQL`. 

You can also use a string concatentation method in `Python`, by opening up a parentheses and adding strings _without commas_ on new lines between them. 

If you print `SQL` you'll see it's just one long string with spaces inside of it. You could also use docstrings with the three quotes `"""` to write a multiline string, or even read in the `SQL` from a file.

***
***

# Checkpoint 1 of 9
## Now you try!

### We've just created the `companies` table. Now let's create the `contacts` table in the same manner. To create it, look at the schema in the image above. 
### You'll need an `id`, `name`, `email`, and `company_id` saved in various formats.

In [8]:
sql =   '''
        CREATE TABLE IF NOT EXISTS contacts (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT NOT NULL,
        email TEXT NOT NULL,
        company_id INTEGER)
        '''

In [9]:
cursor.execute(sql)

***
***

## Inserting Records 

The next thing we'll want to do is insert some records into the database; let's add `Queens College` to the companies table.

Here, we'll create a `SQL` template for inserting the names of companies into the table. Look at the query below>  

We don't have to assign an id, since it will be automatically assigned using the `AUTOINCREMENT` property of that field.

The `?` is a parameter to the query, and can be used as a placeholder for any user input. Values for the parameters are then passed to the second argument of the `execute` method as a tuple.

In [10]:
sql = "INSERT INTO companies (name) VALUES (?)"

Now, let's execute it!

In [11]:
cursor.execute(sql, ("Queens College",))

The last thing we need is the `commit` call. 

_Nothing will be written to the database until commit is called_. This gives us an interesting ability to do _transactions_ - a series of `SQL` queries that when completed together succesfully, we commit them. 

However if something goes wrong during execution, we don't commit and therefore "rollback".

In [12]:
conn.commit()

**As a side note:** You **_SHOULD NOT_** use string formatting methods like: 

```python
sql = "INSERT INTO companies (name) VALUES ({})".format("Queens College")
```

This is potentially unsafe behavior, and the `?` parameters do a lot of work on your behalf to make sure things work correctly and securely.

***
***

# Checkpoint 2 of 9
## Now you try! 

### Let's go ahead and insert another record using the same `SQL` statement. Let's add in the `NYC Department of Education`. 
### First, let's reuse the `SQL` string from before:

                   sql = "INSERT INTO companies (name) VALUES (?)"

### But now add this new organization to the table `companies`.

In [13]:
sql = "INSERT INTO companies (name) VALUES (?)"

In [14]:
cursor.execute(sql, ("NYC Department of Education",))

In [15]:
conn.commit()

***
***

# Selecting Records

So, let's take a step back and first learn about the basic anatomy of a `SQL` statement. Let's examine a simple query that selects a column from a sample table. Look at the image below: 

![SQL_Statement](Images/05_anatomy-of-select-statement.png)

The basic `SQL` statement always has two parts: a `SELECT` and a `FROM`. The `SELECT` are the columns from the tables you wish to query and return. The `FROM` is where the columns in the `SELECT` are coming from. 

In example above, we're selecting the `id` and `username` columns from the table called `users`. 

We can use `SELECT *` to select all fields from a table if so desired. 

While not required, we can also use a `WHERE` clause! Think of it like a "subset" of your table, where we pick the rows from the table that meet some criterion. In our example, we're only returning rows from the columns `id` and `username` if the column `enabeled` has the value `true`.

**NOTE:** One ODD feature of `SQL` is that for boolean evaluations, whereas in `Python` and most other languages we could use the double `=` (==) to see if a value is equal to another, `SQL` only uses ONE `=`. 

**ALSO NOTE:** While `Python` is case and indent sensitive, most `SQL` languages aren't. However the clause commands like `SELECT` OR `WHERE` DO NOT need to be capitalized or indented in a particular way for the query to work, but are captialized (and sometimes indented) out of convention. 

Indeed, notice that in the `SQL` statement only ONE `=` is used in the `WHERE` clause. 

***

Let's give it a try! 

Let's try and query the `id` column from the `companies` table. In other words, we're going to `SELECT` `id` coming FROM the table `companies`, and let's only select those rows `WHERE` the company's name is `Queens College`.

In [16]:
sql_query_Select = '''
            SELECT id
            FROM companies
            WHERE name = "Queens College"
'''

In [17]:
cursor.execute(sql_query_Select)

Now, let's fetch the results from the query using `cursor.fetchall()` and printing it to the screen. 

Alternatively, you could also use the `fetchone()` statement, which goes and gets the first record it finds. Note that the name of companies are not constrained uniqueness, therefore there could be multiple "Queens College" records fetched from this query. 

If you wanted all of them, you would use `fetchall()`. Since in our table there is only one row with the name "Queens College" we can use either one.

In either case, since "Queens College" was the first entry in the table, it should have an id of 1.

In [18]:
print(cursor.fetchall())

[(1,), (4,), (7,), (10,), (13,), (16,)]

***
***

# Checkpoint 3 of 9
## Now you try!

### Write your own `SQL` query that returns the ID of the "`NYC Department of Education`" from the previous checkpoint. 
### Run the query and return the results. The ID should be `2`, as it's the second value in the table `companies`.

In [19]:
sql_query_Select = '''
            SELECT id
            FROM companies
            WHERE name = "NYC Department of Education"
'''

In [20]:
cursor.execute(sql_query_Select)

In [21]:
print(cursor.fetchall())

[(2,), (5,), (8,), (11,), (14,), (17,)]

***
***

***

## Querying Using Tuples

We can also write and execute our queries in a different way, by passing the value in the `WHERE` clause as a parameter into `cursor.execute()`. 

Using the same parameter statement in our predicate clause and passing in the tuple containing "Queens College" as an argument to `execute`, we can select the id that we need, which is returned as a `Row`. 

`Row`s present themselves as tuples, and since we only fetched the ID, it is the first element in the record.

In [22]:
cursor.execute("SELECT id FROM companies WHERE name=?", ("Queens College",))

In [23]:
print(cursor.fetchone())

(1,)

***

## Inserting Multiple Values (Rows)

Now to insert a person (me!) who works for Queens College you would write a statement similar to:

In [24]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("Charles J. Gomez", "charles.gomez@qc.cuny.edu", 1)) #ID of 1 b/c it's at QC
conn.commit()

***
***

# Checkpoint 4 of 9
## Now you try!

### Using the same method above, insert some contacts into the `contacts` table and insert some new `companies` into the `companies` table. 

### Note that in the `contacts` table, you need to include a `company_id` for each record. Be sure to keep track of who works where! For instance, a value of `1` is "Queens College" and a value of `2` is the "NYC Department of Education".  So, you'll first need to add company values and then add contacts to keep track of who works where. 

### For instance, if you add a new organization, it'll have a value of `3`, and any `contact` you add who works in `3` will need to have the ID of `3`. Whereas any person you add who works at "Queens College" should have an ID of `1`. 

### Add about two to three records in each table. (Be creative!)

In [25]:
sql = "INSERT INTO companies (name) VALUES (?)"

In [26]:
cursor.execute(sql, ("NYC Department of Buildings",))

In [27]:
conn.commit()

In [28]:
sql_query_Select = '''
            SELECT id
            FROM companies
            WHERE name = "NYC Department of Buildings"
'''

In [29]:
cursor.execute(sql_query_Select)

In [30]:
print(cursor.fetchall())

[(3,), (6,), (9,), (12,), (15,), (18,)]

In [31]:
#Queens College ID#1

In [32]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("John Doe", "john.doe@qc.cuny.edu", 1)) 
conn.commit()

In [33]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("Ana He Gu", "ana.hegu78@qc.cuny.edu", 1)) 
conn.commit()

In [34]:
#NYC Department of Education ID#2

In [35]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("Kate Smith", "kate.smith@education.nyc.gov", 2)) 
conn.commit()

In [36]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("Jack Miller", "jack.miller@education.nyc.gov", 2)) 
conn.commit()

In [37]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("Gina Johnson", "gina.johnson@education.nyc.gov", 2)) 
conn.commit()

In [38]:
#NYC Department of Buildings ID#3

In [39]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("Mary Jane", "mary.jane@buildings.nyc.gov", 3)) 
conn.commit()

In [40]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("George Brown", "george.brown@buildings.nyc.gov", 3)) 
conn.commit()

In [41]:
sql = "INSERT INTO contacts (name, email, company_id) VALUES (?,?,?)" 
cursor.execute(sql, ("Luke Davis", "luke.davis@buildings.nyc.gov", 3)) 
conn.commit()

***
***

# Joins with `SQL`

`SQL` handles relationships through the use of `JOIN`s. `JOIN`s are clauses in `SQL` statements that link two tables based on one or more fields. 

With `JOINs`, relational databases can reduce redundancy. A table doesn't have to contain all the fields related to its rows, and table data can be used in multiple places. In other words, when information is stored in separate tables, the way to recombine the information is to do a join. In `SQL`, `JOIN` is a means of combining fields from two tables by using values common to each.


There are several types of JOINs. To describe these different types, we need to add some data to our database so we can show the characteristics of each type. We commonly use Venn diagrams to represent the behavior of `SQL` joins, such as this one:   
![SQL Joins](Images/05_sqljoins.jpg)

Here are some additional resources that you may find helpful as you are learning about and practicing SQL JOINS (and using `sqlite`):


- [Tutorials point on Joins](http://www.tutorialspoint.com/sql/sql-using-joins.htm)
    - [Tutorials point specifically for sqlite](http://www.tutorialspoint.com/sqlite/)    
    
- [W3 schools on Joins](http://www.w3schools.com/sql/sql_join.asp)
    - [W3 schools resources specifically for sqlite](http://www.w3resource.com/sqlite/index.php)    
    
- [A visual explanation of sql joins](http://blog.codinghorror.com/a-visual-explanation-of-sql-joins/)

***
***

Joins are just the `SQL` name for `merges` in `Pandas` (or `R`). There's nothing really too unfamiliar about them. The underlying principles are the same. 

Let's start with a simple `JOIN`. We have two tables: `contacts` and `companies`. They are connected by the key `company_id`. You added a few records in the previous checkpoints. So now let's join these tables together using the `company_id`.

In [42]:
sql_join = '''
            SELECT companies.name AS company_name,
                    contacts.name AS contact_name,
                    contacts.email
            FROM companies
            JOIN contacts
            ON companies.id = contacts.company_id
'''

Let's see what this code is doing step by step. 

***

```Python 
            SELECT companies.name AS company_name,
                    contacts.name AS contact_name,
```

When we select columns from specific tables, we use the format `TABLE`.`COLUMN_NAME` in the query. So, since we want `name` from `companies` and `name` from `contacts` we use `companies.name` and `contacts.name` in `SELECT` to query these columns. So, our query is merely selecting from the tables `companies` and `contacts` the names of the companies and personnel we've added, respectively. 

**However**, it's generally a best practice for column names to be distinct. Here, `name` is the `companies` table refers to a company name, while `name` in `contacts` is a person's name. This sort of annoying naming convention will pop up a lot in data tables. 

Using `AS`, we can rename the columns of the resulting query. So, I re-label `name` from companies as `company_name` and `name` from `contacts` as `contact_name`. 

***

```Python
            contacts.email
```
I'm also going to select the emails of the contacts from the `contact` table. 
***NOTE*** that I do not include another comma here, as this is the last column we're selecting. 

***

```Python
            FROM companies
```

Next, I define my `FROM` statement. I'm going pull from the table `companies`. 

***

```Python
            JOIN contacts
```

Then, I'm going to `JOIN` `companies` on a new table `contacts`. (Again, this is what `SQL` calls a `merge`.) 

Since this is just a simple `JOIN`, I can swap `companies` and `contacts` in the `FROM` and the `JOIN` clauses, as the order doesn't matter for `JOIN` operations. **THIS IS NOT THE CASE FOR OTHER JOINS, WHERE ORDER MATTERS.**

***
```Python
            ON companies.id = contacts.company_id
```

Finally, I need to define what the name of the keys by which we will join these tables. **NOTE** that the names of the same ID are **_DIFFERENT_** in the two tables, `id` in `companies` and `company_id` in `contacts`. Also **note** that `id` nor `company_id` are in the `SELECT` clause, as you don't need them. `SELECT` _just_ returns what you want!

In [43]:
cursor.execute(sql_join)

Let's see what we got!

In [44]:
print(cursor.fetchall())

[('Queens College', 'Charles J. Gomez', 'charles.gomez@qc.cuny.edu'), ('Queens College', 'John Doe', 'john.doe@qc.cuny.edu'), ('Queens College', 'Ana He Gu', 'ana.hegu78@qc.cuny.edu'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('Queens College', 'Charles J. Gomez', 'charles.gomez@qc.cuny.edu'), ('Queens College', 'John Doe', 'john.doe@qc.cuny.edu'), ('Queens College', 'Ana He Gu', 'ana.hegu78@qc.cuny.edu'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('Queens College', 'Charles J. Gomez', 'charles.gomez@qc.cuny.edu'), ('Queens College', 'John Doe', 'john.doe@qc.cuny.edu'), ('Queens College', 'Ana He Gu', 'ana.hegu78@qc.cuny.edu'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('Queens College', 'Charles J. Gomez', 'charles.gomez@qc.cuny.edu'), ('Queens College', 'John Doe', 'john.doe@qc.cuny.edu'), ('Queens College', 'Ana He Gu', 'ana.hegu78@qc.cuny.edu'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('Queens College', 'Charles J. Gomez', 'charles.gomez@qc.cuny.edu'), ('Queens College', 'John Doe', 'john.doe@qc.cuny.edu'), ('Queens College', 'Ana He Gu', 'ana.hegu78@qc.cuny.edu'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('Queens College', 'Charles J. Gomez', 'charles.gomez@qc.cuny.edu'), ('Queens College', 'John Doe', 'john.doe@qc.cuny.edu'), ('Queens College', 'Ana He Gu', 'ana.hegu78@qc.cuny.edu'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov')]

The output format isn't exactly great for us humans to read. 

So, let's bring in `Pandas` and convert this output into a `DataFrame`.

In [45]:
import pandas as pd

Lucky for us, `Pandas` has already has this solved for us! 

All we have to do is use the function `pd.read_sql()` and input in our `SQL` code and the connection to the database. 

Here, our `SQL` code in `sql_leftjoin` and our connection is `conn`.

In [46]:
Contact_Company_Join_df = pd.read_sql(sql_join, conn)

Let's check it out!

In [47]:
Contact_Company_Join_df.head()

,company_name,contact_name,email
0,Queens College,Charles J. Gomez,charles.gomez@qc.cuny.edu
1,Queens College,John Doe,john.doe@qc.cuny.edu
2,Queens College,Ana He Gu,ana.hegu78@qc.cuny.edu
3,NYC Department of Education,Kate Smith,kate.smith@education.nyc.gov
4,NYC Department of Education,Jack Miller,jack.miller@education.nyc.gov

Way better! 

We'll use `Pandas` from now on to query in data. 

**NOTE:** We can't create tables in our `SQL` database with `pd.read_sql()`, as it merely reads in data.

***
***

# Checkpoint 5 of 9
## Now you try! 

### Perform the same query as above, but name `companies.name` and `contacts.name` as something different than  `company_name` or `contact_name`. 
### In addition, add a `WHERE` clause at the end of your join query, and return rows where the contact DOES NOT work at "Queens College". 
### To peform a `NOT` operation, use `!=` operator. In `SQL`, you can also use its `NOT` operator `<>`  as well. 

### Finally, use `Pandas` and read in your query into a `DataFrame` to capture the results. 

### **NOTE:** What `name` (from the table `companies`) do you use in the `WHERE` clause, the full name `companies.name` or your new alias? In `sqlite`, you can use either, but not for all versions of `SQL`.

In [48]:
sql_join = '''
            SELECT companies.name AS entity_name,
                    contacts.name AS contact_info,
                    contacts.email
            FROM companies
            JOIN contacts
            ON companies.id = contacts.company_id
            WHERE entity_name != "Queens College"
'''

In [49]:
cursor.execute(sql_join)

In [50]:
print(cursor.fetchall())

[('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov'), ('NYC Department of Education', 'Kate Smith', 'kate.smith@education.nyc.gov'), ('NYC Department of Education', 'Jack Miller', 'jack.miller@education.nyc.gov'), ('NYC Department of Education', 'Gina Johnson', 'gina.johnson@education.nyc.gov'), ('NYC Department of Buildings', 'Mary Jane', 'mary.jane@buildings.nyc.gov'), ('NYC Department of Buildings', 'George Brown', 'george.brown@buildings.nyc.gov'), ('NYC Department of Buildings', 'Luke Davis', 'luke.davis@buildings.nyc.gov')]

In [51]:
Contact_Company_Join_df2 = pd.read_sql(sql_join, conn)

In [52]:
Contact_Company_Join_df2.head()

                   entity_name  contact_info                           email
0  NYC Department of Education    Kate Smith    kate.smith@education.nyc.gov
1  NYC Department of Education   Jack Miller   jack.miller@education.nyc.gov
2  NYC Department of Education  Gina Johnson  gina.johnson@education.nyc.gov
3  NYC Department of Buildings     Mary Jane     mary.jane@buildings.nyc.gov
4  NYC Department of Buildings  George Brown  george.brown@buildings.nyc.gov

***
***

***
***

# `SQL` with `Pandas` and Complex Joins with Marvel Superheroes 

Now, let's do something fun! Let's explore the Marvel Superhero Universe using the concept of `SQL` `JOINS` (in particular, we'll be using `sqlite`). 

![Marvel Superheroes](Images/05_marvel.png) (from http://vignette1.wikia.nocookie.net/marveldatabase/images/e/e1/The_Marvel_Universe.png/revision/latest?cb=20110513164401)

There are a **lot** of superheroes in the Marvel Universe, and a **lot** of superhero movies, so we'll just be examining a small portion today. 

As you'll see, we are storing the information about the superheroes separately from the information about the superhero movies. In addition, since superheroes frequently use aliases rather than their real names, it makes sense that we might want to store those real names separately from their superhero personae. 

Ok, let's get started. We've already imported `sqlite`, so we'll need to establish a connection to the database. 

In this case however, we've already built a database for you called "superheroes.db" in your `Data` folder, and it will be your job to implement different kinds of joins in order to answer the questions below.

In [53]:
DBPATH_MSU = 'Data/superheroes.db'

In [54]:
conn_MSU = sqlite3.connect(DBPATH_MSU)

Here is what the database looks like:

![SuperheroesDB](Images/05_superheroesDB.png)

Next we'll create a cursor object to help us execute our `SQL` statements:

In [55]:
cursor_MSU = conn_MSU.cursor()

The `JOIN` statements we write will all follow roughly the same pattern that our `SELECT` statements followed in this morning's workshop. That is to say they will look something like:

```python
cursor.execute("SELECT [information] FROM [first_table] [SOME JOIN] [second_table] ON firsttable.id = secondtable.id")
print(cursor.fetchall())
```

***
***

## Who's the star of the movie?

How can we query our database to determine who is the star of the movie? 

In this case, let's use `LEFT JOIN` to pair the title of each movie with the name of its main character.

Look at the query below. Here I'm going to use the `*` symbol in the `SELECT` statement to return ALL of the columns in both tables. 

However, when I want to select specific columns from specific tables, I again use the format `TABLE`.`COLUMN_NAME` in the `ON` clause in the query. 

Here, I'm selecting all columns from `Movies` and `Superheroes` using the `*`, and then I'm joining these two tables on their joint `key` column, in this case `superhero_id`. I'm doing this with the `ON` clause.

In [56]:
sql_leftjoin = '''
            Select * 
                FROM Movies
            LEFT JOIN RealNames
            ON Movies.superhero_id = RealNames.superhero_id
        '''

In [57]:
cursor_MSU.execute(sql_leftjoin)

In [58]:
print(cursor_MSU.fetchall())

[(1, 'Iron Man', 1, 1, 'Tony Stark', 1), (2, 'Iron Man 2', 1, 1, 'Tony Stark', 1), (3, 'Iron Man 3', 1, 1, 'Tony Stark', 1), (4, 'Guardians of the Galaxy', 8, 9, 'Peter Quill', 8), (5, 'Ant-Man', 2, 5, 'Hank Pym', 2), (5, 'Ant-Man', 2, 4, 'Scott Lang', 2), (6, 'Deadpool', 3, 8, 'Wade Wilson', 3), (7, 'The Incredible Hulk', 7, 2, 'Bruce Banner', 7), (8, 'Captain America: The First Avenger', 5, 6, 'Steve Rogers', 5)]

***
***

The format isn't exactly great for us humans. 

So, let's bring in `Pandas` and convert this output into a `DataFrame`.

In [59]:
import pandas as pd

Lucky for us, `Pandas` has already has this solved for us! 

All we have to do is use the function `pd.read_sql()` and input in our `SQL` code and the connection to the database. 

Here, our `SQL` code in `sql_leftjoin` and our connection is `conn`.

In [60]:
Marvel_df = pd.read_sql(sql_leftjoin, conn_MSU)

Let's check it out!

In [61]:
Marvel_df.head()

   id                    title  superhero_id  id         name  superhero_id
0   1                 Iron Man             1   1   Tony Stark             1
1   2               Iron Man 2             1   1   Tony Stark             1
2   3               Iron Man 3             1   1   Tony Stark             1
3   4  Guardians of the Galaxy             8   9  Peter Quill             8
4   5                  Ant-Man             2   5     Hank Pym             2

Cool, it worked! Notice that while both `superhero_id` columns from both tables are fully aligned because the `JOIN`, we now have two columns! This is both redundant (and a waste of hard drive space) and may be confusing for future joins with this new table. 

Futhermore, `id` is a row id of their respective tables that doesn't provide any useful information. 

How do we clean this up a bit?

***
***

# Checkpoint 6 of 9
## Now you try!

### Repeat the same `LEFT JOIN` merge as before, but now select specific columns from each table:
    - title and superhero_id from the table Movies
    - name from the table RealNames
### Write the query in `SQL` and read it in with `Pandas`. 

### *Hint:* You don't need to have the column in the `SELECT` statement in order for you to do a join!

In [62]:
DBPATH_MSU2 = 'Data/superheroes.db'

In [63]:
conn_MSU2 = sqlite3.connect(DBPATH_MSU)

In [64]:
cursor_MSU2 = conn_MSU2.cursor()

In [65]:
sql_leftjoin = '''
            Select Movies.superhero_id, Movies.title, Realnames.name
            FROM Movies
            LEFT JOIN RealNames
            ON Movies.superhero_id = RealNames.superhero_id
        '''

In [66]:
cursor_MSU2.execute(sql_leftjoin)

In [67]:
print(cursor_MSU.fetchall())

[]

In [68]:
Marvel_df = pd.read_sql(sql_leftjoin, conn_MSU)

In [69]:
Marvel_df.head()

   superhero_id                    title         name
0             1                 Iron Man   Tony Stark
1             1               Iron Man 2   Tony Stark
2             1               Iron Man 3   Tony Stark
3             8  Guardians of the Galaxy  Peter Quill
4             2                  Ant-Man     Hank Pym

***
***

## Note on Right Joins and Full Outer Joins

In `sqlite` you cannot perform them. Again, we're using `sqlite` as a pedagogical tool. The various `SQL` platforms you'll use will be very similar to `sqlite` and your queries will allow you to use both sorts of `JOINs`. Since we're restricted by CPU and memory-usage, we cannot use them here. 

***
***

***
***

# Nested Joins

We can also run nested joins, or joins within joins. So, instead of running two joins at once, we can run and construct our output all in one large query. 

Let's look at our original query. 

```Python
            Select * 
                FROM Movies
            LEFT JOIN RealNames
            ON Movies.superhero_id = RealNames.superhero_id
```

This essentially produces a table. If so, we can query from it! If so, then we can treat this query as a table and perform other query operations on it! In the query above, we `LEFT JOINed` `Movies` with `RealNames`. 

Say we now want to know their superhero names. We can nest this query and treat it as a table in a NEW query and join it with the superhero names. 

**NOTE:** The superhero id in the table `Superheroes` is just `id` and not `superhero_id` as it is in the other tables. 

```Python
        Select *
            From Superheroes
        JOIN (
              Select * 
                FROM Movies
              LEFT JOIN RealNames
              ON Movies.superhero_id = RealNames.superhero_id
              ) AS Movies_RealNames
        ON Movies_RealNames.superhero_id = Superheores.id
```        

This nested query looks scary at first, but look at what it just really is:

```Python
        Select *
            From Superheroes
        JOIN Movies_RealNames
        ON Movies_RealNames.superhero_id = Superheores.id
``` 

It's just a regular join with a new table we made! We just need to use `AS` to rename the table. Here, I called our nested query table `Movies_RealNames` as it's the merge between the tables `Movie` and `RealNames`. 

Let's read it in and check it out!

In [70]:
sql_nested = '''
        Select *
            From Superheroes
        JOIN (
              Select * 
                FROM Movies
              LEFT JOIN RealNames
              ON Movies.superhero_id = RealNames.superhero_id
              ) AS Movies_RealNames
        ON Movies_RealNames.superhero_id = Superheroes.id
'''

In [71]:
Marvel_Nested_df = pd.read_sql(sql_nested, conn_MSU)

In [72]:
Marvel_Nested_df.head()

,id,name,id,title,superhero_id,id:1,name,superhero_id:1
0,1,Iron Man,1,Iron Man,1,1,Tony Stark,1
1,1,Iron Man,2,Iron Man 2,1,1,Tony Stark,1
2,1,Iron Man,3,Iron Man 3,1,1,Tony Stark,1
3,8,Starlord,4,Guardians of the Galaxy,8,9,Peter Quill,8
4,2,Ant-Man,5,Ant-Man,2,5,Hank Pym,2

***
***

# Checkpoint 7 of 9
## Now you try!

### Create a run your own nested query! Don't merely copy-and-paste the one we went through here. Create your own (i.e., change the order of the joins). 

### Use the three tables from the Marvel Superhero Universe database. 

### Again, use `Pandas` to read in and store the query as a `DataFrame`.

In [73]:
sql_nested_2 = '''
        Select *
            From RealNames
        JOIN (
              Select *
                FROM Movies
              LEFT JOIN Superheroes
              ON Movies.superhero_id = Superheroes.id
              ) AS Movies_Superheroes
        ON Movies_Superheroes.superhero_id = RealNames.superhero_id
'''

In [74]:
cursor_MSU2.execute(sql_nested_2)

In [75]:
Marvel_Nested_df2 = pd.read_sql(sql_nested_2, conn_MSU)

In [76]:
Marvel_Nested_df2.head()

,id,name,superhero_id,id,title,superhero_id,id:1,name
0,1,Tony Stark,1,1,Iron Man,1,1,Iron Man
1,1,Tony Stark,1,2,Iron Man 2,1,1,Iron Man
2,1,Tony Stark,1,3,Iron Man 3,1,1,Iron Man
3,2,Bruce Banner,7,7,The Incredible Hulk,7,7,Hulk
4,4,Scott Lang,2,5,Ant-Man,2,2,Ant-Man

***
***

# Multiprocessing in Python

You'll likely want to speed up your code at some in your career. Thankfully multiprocessing is here to help. 

CPUs with multiple cores have become the standard in the recent development of modern computer architectures and we can not only find them in supercomputer facilities but also in our desktop machines at home, and our laptops!

However, the default `Python` interpreter was designed with simplicity in mind and has a thread-safe mechanism: the “GIL” (Global Interpreter Lock). In order to prevent conflicts between threads, it executes only one statement at a time. This is called "serial processing," or "single-threading."

To get around, we'll use the `multiprocessing` module and we will see how we can spawn multiple subprocesses to avoid some of the GIL’s disadvantages.

The image below distinguishes between serial processing, what we've been doing up to this point, and parallel processing. 
    - Serial memory processing is the act of attending to and processing one item at a time. 
    - Parallel memory processing, by constract, is the act of attending to and processing all items simultaneously.

![serial vs multiprocessing](Images/05_multiprocessing_scheme.png)


***
***

Another way of visualizing this is shown below for both serial and multiprocessing. 
Serial processing with the GIL is shown here: 

![serial vs multiprocessing](Images/05_serial_processing.jpeg)

***
***

Multiprocessing that subverts the GIL is shown here: 

![serial vs multiprocessing](Images/05_multi_processing.jpeg)

***
***

# Multi-Threading vs. Multi-Processing

Depending on the application, two common approaches in parallel programming are either to run code via _threads_ or _multiple processes_. 

## On Threads (Shared Memory)

If we submit “jobs” to different threads, those jobs can be pictured as “sub-tasks” of a single process. However, those threads will usually have access to the same memory areas (i.e., shared memory). As such, this approach can easily lead to conflicts where there is if processes are writing to the same memory location at the same time. (Like outputting to a CSV, for instance.)

## Multiple Processes (Distributed Memory)

A safer approach (although it comes with an additional overhead due to the communication overhead between separate processes) is to submit _multiple processes_ to completely separate memory locations (i.e., distributed memory): **Every process will run completely independent from each other.**

Here, we will take a look at `Python`’s multiprocessing module and how we can use it to submit multiple processes that can run independently from each other in order to make best use of our CPU cores.

***
***

# The `multiprocessing` module
The multiprocessing module in Python’s Standard Library has a lot of powerful features. If you want to read about all the nitty-gritty tips, tricks, and details, I would recommend to use the official documentation as an entry point.

Let's go through a brief overview of different approaches to show how the multiprocessing module can be used for parallel programming.

## The `Process` class and the `Pool` class
The `multiprocessing Python` module contains two classes capable of handling tasks. 

The `Process` class sends each task to a different processor, and the `Pool` class sends sets of tasks to different processors.

While both classes provide a similar speed increase, the `Process` class is more efficient when there are not many processes to execute. Using Pythonanywhere we normally only have 4 CPUs, so this is our case. 

**Key Take-away:**
`Pool` is most useful for **LARGE** number of processes and where each process can execute quickly.
`Process` is most useful for a **SMALL** number of processes where each process takes a longer time to execute.

***
***

## The `Pool` class
The convenient approach for simple parallel processing tasks is provided by the `Pool` class.

There are four methods that are particularly interesting:
    - Pool.apply
    - Pool.map
    - Pool.apply_async
    - Pool.map_async

The `Pool.apply` and `Pool.map` methods are basically equivalents to `Python`’s in-built `apply` and `map` functions.

In [77]:
from multiprocessing import Pool
import multiprocessing

First, we need to create some sort of function. This is called a "worker." It's a function which will be executed in parallel. 

Here, let's define a worker (i.e., function) called `worker` that takes in one parameter. Let's make it simple and let's say it takes in some number and returns its square. 

**Note:** You don't need to call your function `worker`, you can call it whatever you'd like.

In [78]:
def worker(x):
    return x*x

Now, how many processors are we going to use? We can first find out how many processors are available to us using the function `cpu_count()`.

In [79]:
multiprocessing.cpu_count()

2

Note that with `pythonanywhere.com`, you can increase the alloted number of CPUs. It should default for most of us to 4, however you can increase this to even more, if you want! You'll just need to pay a bit more per month. 

Okay, so let's set the number of processors to be the maximum number possible, or 1 minus `cpu_count()`. 

Why minus 1? If **EVERY CPU** were allocated to your process, there's nothing else left for your computer to run its most basic functions (i.e., the OS, etc.). 

**NEVER SET THE NUMBER OF PROCESSORS TO THE NUMBER OF CORES AVAILABLE. At most, it MUST be 1 less.**

In [80]:
num_processors = multiprocessing.cpu_count() - 1

Next, let's create a pool of processors.

In [81]:
p=Pool(processes = num_processors)

Okay, now let's get them to work in parallel! For each worker, it will work on the function with one particular parameter. 

Let's create a list of parameters that we'll pass. Since our function squares the value, let's square the values for the numbers 0, 1, 2, 3, and 4.

In [82]:
parameters = [0,1,2,3,4]

Now, let's use the method `.map()` to map these parameters to our workers. 

Note that we have five parameters (0 through 4) and only three workers. That's okay! Workers will each be assigned one parameter to work on, and then when they're done and available, get the next value. In this way, it's a bit like enhanced serial processing.

In [83]:
output = p.map(worker,parameters)

Finally, let's close out the pool using the method `.close()`.

In [84]:
p.close()

Let's see the output. It should return a list of values, each of which are the respective squares of the inputs.

In [85]:
output

[0, 1, 4, 9, 16]

One **BIG** caveat about using parallel processing in any form of interactive Python (Jupyter Notebooks or terminal-based iPython) is that it might not always work as we've written it here. 

The reasons are a bit complicated. However, if you're expecting to write more complicated you'll need to add a 

```python 
    if __name == '__main__'
``` 

clause before calling your workers. 

The example below should work just as it did above.

In [86]:
if __name__ ==  '__main__': 
    num_processors = multiprocessing.cpu_count() - 1
    p=Pool(processes = num_processors)
    output = p.map(worker,parameters)
    p.close()
    print(output)

[0, 1, 4, 9, 16]

***
***

# Checkpoint 8 of 9
## Now you try!

### Write-up your own simple function (maybe it takes a number a raises it to some n-power or does something else rather basic) and use multiprocessing to print out some output, just as you did here. 
### Input a short list of a few test numbers. 

### **BONUS**--What would you need to do to pass in more than one set of parameters? For example, what if you wrote a function that took in both a number and the n-th power you wanted to raise that number to as parameters? **Hint:** Consider using a list of `tuples`.

In [87]:
def apple(x):
    return x**3

In [88]:
parameters = [i for i in range(0,6)]

In [89]:
type(parameters)

list

In [90]:
tup=tuple(parameters)

In [91]:
type(tup)

tuple

In [92]:
if __name__ ==  '__main__': 
    num_processors = multiprocessing.cpu_count() - 1
    p=Pool(processes = num_processors)
    output = p.map(apple,tup)
    p.close()
    print(output)

[0, 1, 8, 27, 64, 125]

In [93]:
output=tuple(output)

In [94]:
type(output)

tuple

***
***

***
***

We can define our multiprocessing code as a function itself! In other words, we can pass in the parameters into a function that are then passed in to the `map()` method.

Let's try it out. I'm taking the code we just wrote and putting it into its own function. **Note** that I changed `parameters` to `my_parameters` to avoid confusing a local versus a global parameter.

In [95]:
def multiprocessing_function(my_parameters):
    if __name__ ==  '__main__': 
        num_processors = multiprocessing.cpu_count() - 1
        p=Pool(processes = num_processors)
        output = p.map(worker,my_parameters)
        p.close()
        return(output)

Now I'm going to pass in `parameters` into our new function `multiprocessing_function` and return our original `output`. You'll see we get the same result.

In [96]:
multiprocessing_function(parameters)

[0, 1, 4, 9, 16, 25]

***

### Performance?

So, how long does this actually take?

Let's try it with a 1000 numbers, instead of just five. Now, let's use the `time` module to track how long it takes with different number of processes. So far, we've used 1 minus the total number of processors. 

On my machine, that's 3. 

So, let's see how long it takes with 1, 2, and 3 dedicated processors. 

First, let's create a list of new parameters that goes from 0 to 999.

In [97]:
new_parameters = [i for i in range(0,1000)]

Now, let's run our code in a `for loop`, where we pass in different numbers of available processors the pool can use. Here we're only going to use 1, 2, or 3 CPUs. 

For each time we use a different number of CPUs, we're going to output how long it takes in seconds.

In [98]:
import time 
for num_worker_processors in [1,2,3]:
    if __name__ ==  '__main__': 
        start_time = time.process_time()
        p=Pool(processes = num_worker_processors)
        output = p.map(worker,new_parameters)
        end_time = time.process_time() - start_time
        print(num_worker_processors,end_time)

1 0.008086604000000053
2 0.012885641000000003
3 0.01848359799999999

So, with only one processor, it takes about 0.01 seconds, but with two processors, it takes longer, 0.02, and even longer with three, or about 0.03. 

Why is this the case? Recall the discussion earlier about `pool` and `process`. 

***
***

# The `Process` Class

Let's now turn our attention to the `process class`. Let's import it from `multiprocessing`.

In [99]:
from multiprocessing import Process

Let's first create two new functions that are a bit more complex: `basic_function()` and `some_complex_func()`.

With `some_complex_func()`, we square the number that was passed in and print out if it's even or odd by calling `basic_func()`.

In [100]:
def basic_func(x):
    if x == 0:
        return 'zero'
    elif x%2 == 0:
        return 'even'
    else:
        return 'odd'

In [101]:
def some_complex_func(x):
    y = x*x
    time.sleep(2)
    print('{} squared results in a/an {} number'.format(x, basic_func(y)))

Now, let's use the `Process` class.

We've already import `Process` and created a complicated function called `some_complex_func()`. I

```python
    processes_list = []
    for i in range(0,10):
        p = Process(target=some_complex_func, args=(i,))
        processes_list.append(p)
        p.start()
```

In the first `for loop`, shown above, we create a series of `Processes`. We pass in the `target`, or our function called `some_complex_func()`. We also pass in the arguments given as a `tuple`. These are the numbers we're going to square and return if it's even or odd. We're just going to go through numbers 0 through 9. 

Then, we append them together in a list called `processes_list`, which we define before the `for loop`. 

Finally, we start them using the method `.start()`. 

```python
    for process in processes_list:
        process.join()
```

Now, we can join them together! The last loop just calls the `.join()` method on each process in the list `process_list`. This tells `Python` to wait for the process to terminate.

In [102]:
if __name__ == '__main__':
    starttime = time.time()
    processes_list = []
    for i in range(0,10):
        p = Process(target=some_complex_func, args=(i,))
        processes_list.append(p)
        p.start()
        
    for process in processes_list:
        process.join()
        
    print('That took {} seconds'.format(time.time() - starttime))

0 squared results in a/an zero number
1 squared results in a/an odd number
2 squared results in a/an even number
3 squared results in a/an odd number
4 squared results in a/an even number
5 squared results in a/an odd number
6 squared results in a/an even number
7 squared results in a/an odd number
8 squared results in a/an even number
9 squared results in a/an odd number
That took 2.0548713207244873 seconds

All of this looks fine! 

And it only took 2 seconds! So, let's try this now with `Pool`. Below, I use the same code we went through before, but now use our new function `some_complex_func()`. Let's see how long it takes.

In [103]:
if __name__ == '__main__':
    
    starttime = time.time()
    pool = Pool(processes = num_worker_processors)
    pool.map(some_complex_func, range(0,10))
    pool.close()
    print('That took {} seconds'.format(time.time() - starttime))

0 squared results in a/an zero number
1 squared results in a/an odd number
2 squared results in a/an even number
3 squared results in a/an odd number
4 squared results in a/an even number
5 squared results in a/an odd number
6 squared results in a/an even number
7 squared results in a/an odd number
8 squared results in a/an even number
9 squared results in a/an odd number
That took 8.06085753440857 seconds

Unless you are running a machine with more than 10 processors, the `Process` code should run faster than the Pool code. 

We can see that's the case here: 2 seconds (`Process`) versus 8 seconds (`Pool`)

This is because `Process` sends code to a processor as soon as the process is started. 

`Pool` instead sends a code to each available processor and doesn’t send any more until a processor has finished computing the first section of code. 

`Pool` does this so that processes don’t have to compete for computing resources, but this makes it slower than `Process` in cases where each process is lengthy.

***
***

# Working with Data

Let's use `multiprocessing` to work with data. You can do a lot of things when you parallelize things! However, for our purposes, let's get you set up with a simple example. Reading in lots of data. 

Since `Pool` is better for more computational heavy tasks, we'll focus on using `Pool` rather than `Process`.

***

First, let's perform a simple task. 

Let's read in a bunch of files and combine them together into one large `DataFrame`. For simplicity, let's focus on `DataFrames` that have the same format, but are split up into different CSVs. 

So the function we'll use is `Pandas`'s `read_csv` and we're going to pass in as our parameter a list of the file names with their path directories. 

To begin, let's get the list of file names and their directories to read in. How about we read in every file in your `/Data/` directory in `/Class_Materials/` that starts with the filename `gapminder_gdp_`. Specifically, there should be five CSV files total.

Let's use the module `glob` to find these filenames based on a partial `string` match.

In [104]:
import glob

Next make sure you're in `Class_Materials`. If you're not, add a cell (of code) here and `cd` into it. Check your present working directory with `%pwd`.

In [105]:
%pwd

'/home/ahegu/Class_Materials'

Using `glob.glob()`, we're going to go into our `Data/` folder and find the filenames and paths of all files that start with `gapminder_gdp`, where the `*` is a catch-all for anything that comes after the string. We'll learn more about it in a few lessons!

In [106]:
file_list = glob.glob('Data/gapminder_gdp*')

Let's take a look at the contents of the list. 

We should see five CSV files all beginning with `gapminder_gdp`.

In [107]:
file_list

['Data/gapminder_gdp_europe.csv',
 'Data/gapminder_gdp_oceania.csv',
 'Data/gapminder_gdp_americas.csv',
 'Data/gapminder_gdp_africa.csv',
 'Data/gapminder_gdp_asia.csv']

Just like before, we need to put all of our desired operations into a function we'll pass in!

I'm going to create a function called `my_read_csv()`, which just uses `Pandas`'s `read_csv()` function. Even if your function does only one task, it needs to be defined in a function in order for it to be mapped.

In [108]:
def my_read_csv(filename):
    return pd.read_csv(filename)

Now, let's have our `pool` map the file names to `DataFrames` using our new function `my_read_csv()`. 

Let's first set up our `pool` just as we did before and use the `.map()` method from `pool`. 

The only difference is this line of code:

```Python
        df_list = pool.map(my_read_csv, file_list)
```

This maps our function `my_read_csv` to the passed in parameters `file_list`, which contains the file names of each file we're reading in. 

(Don't forget to close your `pool`.)

In [109]:
if __name__ == '__main__':    
    num_processors = multiprocessing.cpu_count() - 1
    pool = Pool(processes = num_processors)
    df_list = pool.map(my_read_csv, file_list)
    pool.close()

Let's see what you did! Run the cell below. 

It's really long! Essentially, it's a `list` of `DataFrames`. Since we read in five `DataFrames` the `list` has five entries, one for each CSV. 

Let's check this out and verify.

In [110]:
df_list

[                   country          2006          2007          2008  \
 0                  Albania   1601.056136   1942.284244   2312.888958
 1                  Austria   6137.076492   8842.598030  10750.721110
 2                  Belgium   8343.105127   9714.960623  10991.206760
 3   Bosnia and Herzegovina    973.533195   1353.989176   1709.683679
 4                 Bulgaria   2444.286648   3008.670727   4254.337839
 5                  Croatia   3119.236520   4338.231617   5477.890018
 6           Czech Republic   6876.140250   8256.343918  10136.867130
 7                  Denmark   9692.385245  11099.659350  13583.313510
 8                  Finland   6424.519071   7545.415386   9371.842561
 9                   France   7029.809327   8662.834898  10560.485530
 10                 Germany   7144.114393  10187.826650  12902.462910
 11                  Greece   3530.690067   4916.299889   6017.190733
 12                 Hungary   5263.673816   6040.180011   7550.359877
 13                 Iceland   7267.688428   9244.001412  10350.159060
 14                 Ireland   5210.280328   5599.077872   6631.597314
 15                   Italy   4931.404155   6248.656232   8243.582340
 16              Montenegro   2647.585601   3682.259903   4649.593785
 17             Netherlands   8941.571858  11276.193440  12790.849560
 18                  Norway  10095.421720  11653.973040  13450.401510
 19                  Poland   4029.329699   4734.253019   5338.752143
 20                Portugal   3068.319867   3774.571743   4727.954889
 21                 Romania   3144.613186   3943.370225   4734.997586
 22                  Serbia   3581.459448   4981.090891   6289.629157
 23         Slovak Republic   5074.659104   6093.262980   7481.107598
 24                Slovenia   4215.041741   5862.276629   7402.303395
 25                   Spain   3834.034742   4564.802410   5693.843879
 26                  Sweden   8527.844662   9911.878226  12329.441920
 27             Switzerland  14734.232750  17909.489730  20431.092700
 28                  Turkey   1969.100980   2218.754257   2322.869908
 29          United Kingdom   9979.508487  11283.177950  12477.177070

             2009          2010          2011          2012          2013  \
 0    2760.196931   3313.422188   3533.003910   3630.880722   3738.932735
 1   12834.602400  16661.625600  19749.422300  21597.083620  23687.826070
 2   13149.041190  16672.143560  19117.974480  20979.845890  22525.563080
 3    2172.352423   2860.169750   3528.481305   4126.613157   4314.114757
 4    5577.002800   6597.494398   7612.240438   8224.191647   8239.854824
 5    6960.297861   9164.090127  11305.385170  13221.821840  13822.583940
 6   11399.444890  13108.453600  14800.160620  15377.228550  16310.443400
 7   15937.211230  18866.207210  20422.901500  21688.040480  25116.175810
 8   10921.636260  14358.875900  15605.422830  18533.157610  21141.012230
 9   12999.917660  16107.191710  18292.635140  20293.897460  22066.442140
 10  14745.625610  18016.180270  20512.921230  22031.532740  24639.185660
 11   8513.097016  12724.829570  14195.524280  15268.420890  16120.528390
 12   9326.644670  10168.656110  11674.837370  12545.990660  12986.479980
 13  13319.895680  15798.063620  19654.962470  23269.607500  26923.206280
 14   7655.568963   9530.772896  11150.981130  12618.321410  13872.866520
 15  10022.401310  12269.273780  14255.984750  16537.483500  19207.234820
 16   5907.850937   7778.414017   9595.929905  11222.587620  11732.510170
 17  15363.251360  18794.745670  21209.059200  21399.460460  23651.323610
 18  16361.876470  18965.055510  23311.349390  26298.635310  31540.974800
 19   6557.152776   8006.506993   9508.141454   8451.531004   9082.351172
 20   6361.517993   9022.247417  10172.485720  11753.842910  13039.308760
 21   6470.866545   8011.414402   9356.397240   9605.314053   9696.273295
 22   7991.707066  10522.067490  12980.669560  15181.092700  15870.878510
 23   8412.902397   9674.167626  10922.664040  11348.545850  12037.267580
 24   9405.489397  12383.486200  15277.030170  17866.721750  18678.534920
 25   7993.512294  10638.751310  13236.921170  13926.169970  15764.983130
 26  15258.296970  17832.024640  18855.725210  20667.381250  23586.929270
 27  22966.144320  27195.113040  26982.290520  28397.715120  30281.704590
 28   2826.356387   3450.696380   4269.122326   4241.356344   5089.043686
 29  14142.850890  15895.116410  17428.748460  18232.424520  21664.787670

             2014          2015          2016          2017
 0    2497.437901   3193.054604   4604.211737   5937.029526
 1   27042.018680  29095.920660  32417.607690  36126.492700
 2   25575.570690  27561.196630  30485.883750  33692.605080
 3    2546.781445   4766.355904   6018.975239   7446.298803
 4    6302.623438   5970.388760   7696.777725  10680.792820
 5    8447.794873   9875.604515  11628.388950  14619.222720
 6   14297.021220  16048.514240  17596.210220  22833.308510
 7   26406.739850  29804.345670  32166.500060  35278.418740
 8   20647.164990  23723.950200  28204.590570  33207.084400
 9   24703.796150  25889.784870  28926.032340  30470.016700
 10  26505.303170  27788.884160  30035.801980  32170.374420
 11  17541.496340  18747.698140  22514.254800  27538.411880
 12  10535.628550  11712.776800  14843.935560  18008.944440
 13  25144.392010  28061.099660  31163.201960  36180.789190
 14  17558.815550  24521.947130  34077.049390  40675.996350
 15  22013.644860  24675.024460  27968.098170  28569.719700
 16   7003.339037   6465.613349   6557.194282   9253.896111
 17  26790.949610  30246.130630  33724.757780  36797.933320
 18  33965.661150  41283.164330  44683.975250  49357.190170
 19   7738.881247  10159.583680  12002.239080  15389.924680
 20  16207.266630  17641.031560  19970.907870  20509.647770
 21   6598.409903   7346.547557   7885.360081  10808.475610
 22   9325.068238   7914.320304   7236.075251   9786.534714
 23   9498.467723  12126.230650  13638.778370  18678.314350
 24  14214.716810  17161.107350  20660.019360  25768.257590
 25  18603.064520  20445.298960  24835.471660  28821.063700
 26  23880.016830  25266.594990  29341.630930  33859.748350
 27  31871.530300  32135.323010  34480.957710  37506.419070
 28   5678.348271   6601.429915   6508.085718   8458.276384
 29  22705.092540  26074.531360  29478.999190  33203.261280  ,
        country         2006         2007         2008         2009  \
 0    Australia  10039.59564  10949.64959  12217.22686  14526.12465
 1  New Zealand  10556.57566  12247.39532  13175.67800  14463.91893

           2010         2011         2012         2013         2014  \
 0  16788.62948  18334.19751  19477.00928  21888.88903  23424.76683
 1  16046.03728  16233.71770  17632.41040  19007.19129  18363.32494

           2015         2016         2017
 0  26997.93657  30687.75473  34435.36744
 1  21050.41377  23189.80135  25185.00911  ,
    continent              country          2006          2007          2008  \
 0   Americas            Argentina   5911.315053   6856.856212   7133.166023
 1   Americas              Bolivia   2677.326347   2127.686326   2180.972546
 2   Americas               Brazil   2108.944355   2487.365989   3336.585802
 3   Americas               Canada  11367.161120  12489.950060  13462.485550
 4   Americas                Chile   3939.978789   4315.622723   4519.094331
 5   Americas             Colombia   2144.115096   2323.805581   2492.351109
 6   Americas           Costa Rica   2627.009471   2990.010802   3460.937025
 7   Americas                 Cuba   5586.538780   6092.174359   5180.755910
 8   Americas   Dominican Republic   1397.717137   1544.402995   1662.137359
 9   Americas              Ecuador   3522.110717   3780.546651   4086.114078
 10  Americas          El Salvador   3048.302900   3421.523218   3776.803627
 11  Americas            Guatemala   2428.237769   2617.155967   2750.364446
 12  Americas                Haiti   1840.366939   1726.887882   1796.589032
 13  Americas             Honduras   2194.926204   2220.487682   2291.156835
 14  Americas              Jamaica   2898.530881   4756.525781   5246.107524
 15  Americas               Mexico   3478.125529   4131.546641   4581.609385
 16  Americas            Nicaragua   3112.363948   3457.415947   3634.364406
 17  Americas               Panama   2480.380334   2961.800905   3536.540301
 18  Americas             Paraguay   1952.308701   2046.154706   2148.027146
 19  Americas                 Peru   3758.523437   4245.256698   4957.037982
 20  Americas          Puerto Rico   3081.959785   3907.156189   5108.344630
 21  Americas  Trinidad and Tobago   3023.271928   4100.393400   4997.523971
 22  Americas        United States  13990.482080  14847.127120  16173.145860
 23  Americas              Uruguay   5716.766744   6150.772969   5603.357717
 24  Americas            Venezuela   7689.799761   9802.466526   8422.974165

             2009          2010          2011          2012          2013  \
 0    8052.953021   9443.038526  10079.026740   8997.897412   9139.671389
 1    2586.886053   2980.331339   3548.097832   3156.510452   2753.691490
 2    3429.864357   4985.711467   6660.118654   7030.835878   7807.095818
 3   16076.588030  18970.570860  22090.883060  22898.792140  26626.515030
 4    5106.654313   5494.024437   4756.763836   5095.665738   5547.063754
 5    2678.729839   3264.660041   3815.807870   4397.575659   4903.219100
 6    4161.727834   5118.146939   5926.876967   5262.734751   5629.915318
 7    5690.268015   5305.445256   6380.494966   7316.918107   7532.924763
 8    1653.723003   2189.874499   2681.988900   2861.092386   2899.842175
 9    4579.074215   5280.994710   6679.623260   7213.791267   6481.776993
 10   4358.595393   4520.246008   5138.922374   4098.344175   4140.442097
 11   3242.531147   4031.408271   4879.992748   4820.494790   4246.485974
 12   1452.057666   1654.456946   1874.298931   2011.159549   1823.015995
 13   2538.269358   2529.842345   3203.208066   3121.760794   3023.096699
 14   6124.703451   7433.889293   6650.195573   6068.051350   6351.237495
 15   5754.733883   6809.406690   7674.929108   9611.147541   8688.156003
 16   4643.393534   4688.593267   5486.371089   3470.338156   2955.984375
 17   4421.009084   5364.249663   5351.912144   7009.601598   7034.779161
 18   2299.376311   2523.337977   3248.373311   4258.503604   3998.875695
 19   5788.093330   5937.827283   6281.290855   6434.501797   6360.943444
 20   6929.277714   9123.041742   9770.524921  10330.989150  12281.341910
 21   5621.368472   6619.551419   7899.554209   9119.528607   7388.597823
 22  19530.365570  21806.035940  24072.632130  25009.559140  29884.350410
 23   5444.619620   5703.408898   6504.339663   6920.223051   7452.398969
 24   9541.474188  10505.259660  13143.950950  11152.410110   9883.584648

             2014          2015          2016          2017
 0    9308.418710  10967.281950   8797.640716  12779.379640
 1    2961.699694   3326.143191   3413.262690   3822.137084
 2    6950.283021   7957.980824   8131.212843   9065.800825
 3   26342.884260  28954.925890  33328.965070  36319.235010
 4    7596.125964  10118.053180  10778.783850  13171.638850
 5    5444.648617   6117.361746   5755.259962   7006.580419
 6    6160.416317   6677.045314   7723.447195   9645.061420
 7    5592.843963   5431.990415   6340.646683   8948.102923
 8    3044.214214   3614.101285   4563.808154   6025.374752
 9    7103.702595   7429.455877   5773.044512   6873.262326
 10   4444.231700   5154.825496   5351.568666   5728.353514
 11   4439.450840   4684.313807   4858.347495   5186.050003
 12   1456.309517   1341.726931   1270.364932   1201.637154
 13   3081.694603   3160.454906   3099.728660   3548.330846
 14   7404.923685   7121.924704   6994.774861   7320.880262
 15   9472.384295   9767.297530  10742.440530  11977.574960
 16   2170.151724   2253.023004   2474.548819   2749.320965
 17   6618.743050   7113.692252   7356.031934   9809.185636
 18   4196.411078   4247.400261   3783.674243   4172.838464
 19   4446.380924   5838.347657   5909.020073   7408.905561
 20  14641.587110  16999.433300  18855.606180  19328.709010
 21   7370.990932   8792.573126  11460.600230  18008.509240
 22  32003.932240  35767.433030  39097.099550  42951.653090
 23   8137.004775   9230.240708   7727.002004  10611.462990
 24  10733.926310  10165.495180   8605.047831  11415.805690  ,
                      country         2006         2007         2008  \
 0                    Algeria  2449.008185  3013.976023  2550.816880
 1                     Angola  3520.610273  3827.940465  4269.276742
 2                      Benin  1062.752200   959.601080   949.499064
 3                   Botswana   851.241141   918.232535   983.653976
 4               Burkina Faso   543.255241   617.183465   722.512021
 5                    Burundi   339.296459   379.564628   355.203227
 6                   Cameroon  1172.667655  1313.048099  1399.607441
 7   Central African Republic  1071.310713  1190.844328  1193.068753
 8                       Chad  1178.665927  1308.495577  1389.817618
 9                    Comoros  1102.990936  1211.148548  1406.648278
 10           Congo Dem. Rep.   780.542326   905.860230   896.314634
 11                Congo Rep.  2125.621418  2315.056572  2464.783157
 12             Cote d'Ivoire  1388.594732  1500.895925  1728.869428
 13                  Djibouti  2669.529475  2864.969076  3020.989263
 14                     Egypt  1418.822445  1458.915272  1693.335853
 15         Equatorial Guinea   375.643123   426.096408   582.841971
 16                   Eritrea   328.940557   344.161886   380.995843
 17                  Ethiopia   362.146280   378.904163   419.456416
 18                     Gabon  4293.476475  4976.198099  6631.459222
 19                    Gambia   485.230659   520.926711   599.650276
 20                     Ghana   911.298937  1043.561537  1190.041118
 21                    Guinea   510.196492   576.267025   686.373674
 22             Guinea-Bissau   299.850319   431.790457   522.034373
 23                     Kenya   853.540919   944.438315   896.966373
 24                   Lesotho   298.846212   335.997115   411.800627
 25                   Liberia   575.572996   620.969990   634.195163
 26                     Libya  2387.548060  3448.284395  6757.030816
 27                Madagascar  1443.011715  1589.202750  1643.387110
 28                    Malawi   369.165080   416.369806   427.901086
 29                      Mali   452.336981   490.382187   496.174343
 30                Mauritania   743.115910   846.120261  1055.896036
 31                 Mauritius  1967.955707  2034.037981  2529.067487
 32                   Morocco  1688.203570  1642.002314  1566.353493
 33                Mozambique   468.526038   495.586833   556.686354
 34                   Namibia  2423.780443  2621.448058  3173.215595
 35                     Niger   761.879376   835.523403   997.766113
 36                   Nigeria  1077.281856  1100.592563  1150.927478
 37                   Reunion  2718.885295  2769.451844  3173.723340
 38                    Rwanda   493.323875   540.289398   597.473073
 39     Sao Tome and Principe   879.583586   860.736903  1071.551119
 40                   Senegal  1450.356983  1567.653006  1654.988723
 41              Sierra Leone   879.787736  1004.484437  1116.639877
 42                   Somalia  1135.749842  1258.147413  1369.488336
 43              South Africa  4725.295531  5487.104219  5768.729717
 44                     Sudan  1615.991129  1770.337074  1959.593767
 45                 Swaziland  1148.376626  1244.708364  1856.182125
 46                  Tanzania   716.650072   698.535607   722.003807
 47                      Togo   859.808657   925.908320  1067.534810
 48                   Tunisia  1468.475631  1395.232468  1660.303210
 49                    Uganda   734.753484   774.371069   767.271740
 50                    Zambia  1147.388831  1311.956766  1452.725766
 51                  Zimbabwe   406.884115   518.764268   527.272182

             2009          2010          2011          2012          2013  \
 0    3246.991771   4182.663766   4910.416756   5745.160213   5681.358539
 1    5522.776375   5473.288005   3008.647355   2756.953672   2430.208311
 2    1035.831411   1085.796879   1029.161251   1277.897616   1225.856010
 3    1214.709294   2263.611114   3214.857818   4551.142150   6205.883850
 4     794.826560    854.735976    743.387037    807.198586    912.063142
 5     412.977514    464.099504    556.103265    559.603231    621.818819
 6    1508.453148   1684.146528   1783.432873   2367.983282   2602.664206
 7    1136.056615   1070.013275   1109.374338    956.752991    844.876350
 8    1196.810565   1104.103987   1133.984950    797.908101    952.386129
 9    1876.029643   1937.577675   1172.603047   1267.100083   1315.980812
 10    861.593242    904.896069    795.757282    673.747818    672.774812
 11   2677.939642   3213.152683   3259.178978   4879.507522   4201.194937
 12   2052.050473   2378.201111   2517.736547   2602.710169   2156.956069
 13   3020.050513   3694.212352   3081.761022   2879.468067   2880.102568
 14   1814.880728   2024.008147   2785.493582   3503.729636   3885.460710
 15    915.596003    672.412257    958.566812    927.825343    966.896815
 16    468.794970    514.324208    505.753808    524.875849    521.134133
 17    516.118644    566.243944    556.808383    577.860747    573.741314
 18   8358.761987  11401.948410  21745.573280  15113.361940  11864.408440
 19    734.782912    756.086836    884.755251    835.809611    611.658861
 20   1125.697160   1178.223708    993.223957    876.032569    847.006113
 21    708.759541    741.666231    874.685864    857.250358    805.572472
 22    715.580640    820.224588    764.725963    838.123967    736.415392
 23   1056.736457   1222.359968   1267.613204   1348.225791   1361.936856
 24    498.639026    496.581592    745.369541    797.263107    773.993214
 25    713.603648    803.005454    640.322438    572.199569    506.113857
 26  18772.751690  21011.497210  21951.211760  17364.275380  11770.589800
 27   1634.047282   1748.562982   1544.228586   1302.878658   1155.441948
 28    495.514781    584.621971    663.223677    632.803921    635.517363
 29    545.009887    581.368876    686.395269    618.014064    684.171558
 30   1421.145193   1586.851781   1497.492223   1481.150189   1421.603576
 31   2475.387562   2575.484158   3710.982963   3688.037739   4783.586903
 32   1711.044770   1930.194975   2370.619976   2702.620356   2755.046991
 33    566.669154    724.917804    502.319733    462.211415    389.876185
 34   3793.694753   3746.080948   3876.485958   4191.100511   3693.731337
 35   1054.384891    954.209236    808.897073    909.722135    668.300023
 36   1014.514104   1698.388838   1981.951806   1576.973750   1385.029563
 37   4021.175739   5047.658563   4319.804067   5267.219353   5303.377488
 38    510.963714    590.580664    670.080601    881.570647    847.991217
 39   1384.840593   1532.985254   1737.561657   1890.218117   1516.525457
 40   1612.404632   1597.712056   1561.769116   1518.479984   1441.720720
 41   1206.043465   1353.759762   1348.285159   1465.010784   1294.447788
 42   1284.733180   1254.576127   1450.992513   1176.807031   1093.244963
 43   7114.477971   7765.962636   8028.651439   8568.266228   7825.823398
 44   1687.997641   1659.652775   2202.988423   1895.544073   1507.819159
 45   2613.101665   3364.836625   3781.410618   3895.384018   3984.839812
 46    848.218657    915.985059    962.492293    874.242607    831.822079
 47   1477.596760   1649.660188   1532.776998   1344.577953   1202.201361
 48   1932.360167   2753.285994   3120.876811   3560.233174   3810.419296
 49    908.918522    950.735869    843.733137    682.266227    617.724406
 50   1777.077318   1773.498265   1588.688299   1408.678565   1213.315116
 51    569.795071    799.362176    685.587682    788.855041    706.157306


In [111]:
len(df_list) #Should be five

5

We can combine these `DataFrames` together into one large `DataFrame` using `pd.concat()`. 

Let's see what this results with.

In [112]:
df_final = pd.concat(df_list)

/usr/lib/python3.6/site-packages/IPython/kernel/__main__.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  if __name__ == '__main__':

If we take a peak at our new `DataFrame`, we'll see that we created one large `DataFrame`.

In [113]:
df_final.head(15)

,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,continent,country
0,1601.056136,1942.284244,2312.888958,2760.196931,3313.422188,3533.003910,3630.880722,3738.932735,2497.437901,3193.054604,4604.211737,5937.029526,NaN,Albania
1,6137.076492,8842.598030,10750.721110,12834.602400,16661.625600,19749.422300,21597.083620,23687.826070,27042.018680,29095.920660,32417.607690,36126.492700,NaN,Austria
2,8343.105127,9714.960623,10991.206760,13149.041190,16672.143560,19117.974480,20979.845890,22525.563080,25575.570690,27561.196630,30485.883750,33692.605080,NaN,Belgium
3,973.533195,1353.989176,1709.683679,2172.352423,2860.169750,3528.481305,4126.613157,4314.114757,2546.781445,4766.355904,6018.975239,7446.298803,NaN,Bosnia and Herzegovina
4,2444.286648,3008.670727,4254.337839,5577.002800,6597.494398,7612.240438,8224.191647,8239.854824,6302.623438,5970.388760,7696.777725,10680.792820,NaN,Bulgaria
5,3119.236520,4338.231617,5477.890018,6960.297861,9164.090127,11305.385170,13221.821840,13822.583940,8447.794873,9875.604515,11628.388950,14619.222720,NaN,Croatia
6,6876.140250,8256.343918,10136.867130,11399.444890,13108.453600,14800.160620,15377.228550,16310.443400,14297.021220,16048.514240,17596.210220,22833.308510,NaN,Czech Republic
7,9692.385245,11099.659350,13583.313510,15937.211230,18866.207210,20422.901500,21688.040480,25116.175810,26406.739850,29804.345670,32166.500060,35278.418740,NaN,Denmark
8,6424.519071,7545.415386,9371.842561,10921.636260,14358.875900,15605.422830,18533.157610,21141.012230,20647.164990,23723.950200,28204.590570,33207.084400,NaN,Finland
9,7029.809327,8662.834898,10560.485530,12999.917660,16107.191710,18292.635140,20293.897460,22066.442140,24703.796150,25889.784870,28926.032340,30470.016700,NaN,France
10,7144.114393,10187.826650,12902.462910,14745.625610,18016.180270,20512.921230,22031.532740,24639.185660,26505.303170,27788.884160,30035.801980,32170.374420,NaN,Germany
11,3530.690067,4916.299889,6017.190733,8513.097016,12724.829570,14195.524280,15268.420890,16120.528390,17541.496340,18747.698140,22514.254800,27538.411880,NaN,Greece
12,5263.673816,6040.180011,7550.359877,9326.644670,10168.656110,11674.837370,12545.990660,12986.479980,10535.628550,11712.776800,14843.935560,18008.944440,NaN,Hungary
13,7267.688428,9244.001412,10350.159060,13319.895680,15798.063620,19654.962470,23269.607500,26923.206280,25144.392010,28061.099660,31163.201960,36180.789190,NaN,Iceland
14,5210.280328,5599.077872,6631.597314,7655.568963,9530.772896,11150.981130,12618.321410,13872.866520,17558.815550,24521.947130,34077.049390,40675.996350,NaN,Ireland

Awesome!

While this simple example, you now have the tools to write up and perform way more complicated functions and tasks, and apply them to your data in parallel.

***
***

# Checkpoint 9 of 9
## Now you try!

### Now, let's re-read in the same set of data, but instead of just merely reading in these files, let's add one more step. Think back to your `Pandas` training and come up with one extra step to add to our `my_read_csv()` function. It can be as simple as just returning the first 10 rows of each `DataFrame` or you can subset the `DataFrame` such that it only returns rows from a specific `Country`, one of the columns in the `DataFrame`. 

### Create a new function (call it whatever you want) that still reads in a CSV, but also performs one additional task. 

### Use `Pool` to map your function to your workers and then use `pd.concat()` to combine the results into one large `DataFrame`.

In [114]:
file_list2 = glob.glob('Data/gapminder_gdp*')

In [115]:
file_list2

['Data/gapminder_gdp_europe.csv',
 'Data/gapminder_gdp_oceania.csv',
 'Data/gapminder_gdp_americas.csv',
 'Data/gapminder_gdp_africa.csv',
 'Data/gapminder_gdp_asia.csv']

In [116]:
def my_read_csv(filename):
    return pd.read_csv(filename,nrows=10)

In [117]:
if __name__ == '__main__':    
    num_processors = multiprocessing.cpu_count() - 1
    pool = Pool(processes = num_processors)
    df_list2 = pool.map(my_read_csv, file_list2)
    pool.close()

In [118]:
df_list2

[                  country         2006          2007          2008  \
 0                 Albania  1601.056136   1942.284244   2312.888958
 1                 Austria  6137.076492   8842.598030  10750.721110
 2                 Belgium  8343.105127   9714.960623  10991.206760
 3  Bosnia and Herzegovina   973.533195   1353.989176   1709.683679
 4                Bulgaria  2444.286648   3008.670727   4254.337839
 5                 Croatia  3119.236520   4338.231617   5477.890018
 6          Czech Republic  6876.140250   8256.343918  10136.867130
 7                 Denmark  9692.385245  11099.659350  13583.313510
 8                 Finland  6424.519071   7545.415386   9371.842561
 9                  France  7029.809327   8662.834898  10560.485530

            2009          2010          2011          2012          2013  \
 0   2760.196931   3313.422188   3533.003910   3630.880722   3738.932735
 1  12834.602400  16661.625600  19749.422300  21597.083620  23687.826070
 2  13149.041190  16672.143560  19117.974480  20979.845890  22525.563080
 3   2172.352423   2860.169750   3528.481305   4126.613157   4314.114757
 4   5577.002800   6597.494398   7612.240438   8224.191647   8239.854824
 5   6960.297861   9164.090127  11305.385170  13221.821840  13822.583940
 6  11399.444890  13108.453600  14800.160620  15377.228550  16310.443400
 7  15937.211230  18866.207210  20422.901500  21688.040480  25116.175810
 8  10921.636260  14358.875900  15605.422830  18533.157610  21141.012230
 9  12999.917660  16107.191710  18292.635140  20293.897460  22066.442140

            2014          2015          2016          2017
 0   2497.437901   3193.054604   4604.211737   5937.029526
 1  27042.018680  29095.920660  32417.607690  36126.492700
 2  25575.570690  27561.196630  30485.883750  33692.605080
 3   2546.781445   4766.355904   6018.975239   7446.298803
 4   6302.623438   5970.388760   7696.777725  10680.792820
 5   8447.794873   9875.604515  11628.388950  14619.222720
 6  14297.021220  16048.514240  17596.210220  22833.308510
 7  26406.739850  29804.345670  32166.500060  35278.418740
 8  20647.164990  23723.950200  28204.590570  33207.084400
 9  24703.796150  25889.784870  28926.032340  30470.016700  ,
        country         2006         2007         2008         2009  \
 0    Australia  10039.59564  10949.64959  12217.22686  14526.12465
 1  New Zealand  10556.57566  12247.39532  13175.67800  14463.91893

           2010         2011         2012         2013         2014  \
 0  16788.62948  18334.19751  19477.00928  21888.88903  23424.76683
 1  16046.03728  16233.71770  17632.41040  19007.19129  18363.32494

           2015         2016         2017
 0  26997.93657  30687.75473  34435.36744
 1  21050.41377  23189.80135  25185.00911  ,
   continent             country          2006          2007          2008  \
 0  Americas           Argentina   5911.315053   6856.856212   7133.166023
 1  Americas             Bolivia   2677.326347   2127.686326   2180.972546
 2  Americas              Brazil   2108.944355   2487.365989   3336.585802
 3  Americas              Canada  11367.161120  12489.950060  13462.485550
 4  Americas               Chile   3939.978789   4315.622723   4519.094331
 5  Americas            Colombia   2144.115096   2323.805581   2492.351109
 6  Americas          Costa Rica   2627.009471   2990.010802   3460.937025
 7  Americas                Cuba   5586.538780   6092.174359   5180.755910
 8  Americas  Dominican Republic   1397.717137   1544.402995   1662.137359
 9  Americas             Ecuador   3522.110717   3780.546651   4086.114078

            2009          2010          2011          2012          2013  \
 0   8052.953021   9443.038526  10079.026740   8997.897412   9139.671389
 1   2586.886053   2980.331339   3548.097832   3156.510452   2753.691490
 2   3429.864357   4985.711467   6660.118654   7030.835878   7807.095818
 3  16076.588030  18970.570860  22090.883060  22898.792140  26626.515030
 4   5106.654313   5494.024437   4756.763836   5095.665738   5547.063754
 5   2678.729839   3264.660041   3815.807870   4397.575659   4903.219100
 6   4161.727834   5118.146939   5926.876967   5262.734751   5629.915318
 7   5690.268015   5305.445256   6380.494966   7316.918107   7532.924763
 8   1653.723003   2189.874499   2681.988900   2861.092386   2899.842175
 9   4579.074215   5280.994710   6679.623260   7213.791267   6481.776993

            2014          2015          2016          2017
 0   9308.418710  10967.281950   8797.640716  12779.379640
 1   2961.699694   3326.143191   3413.262690   3822.137084
 2   6950.283021   7957.980824   8131.212843   9065.800825
 3  26342.884260  28954.925890  33328.965070  36319.235010
 4   7596.125964  10118.053180  10778.783850  13171.638850
 5   5444.648617   6117.361746   5755.259962   7006.580419
 6   6160.416317   6677.045314   7723.447195   9645.061420
 7   5592.843963   5431.990415   6340.646683   8948.102923
 8   3044.214214   3614.101285   4563.808154   6025.374752
 9   7103.702595   7429.455877   5773.044512   6873.262326  ,
                     country         2006         2007         2008  \
 0                   Algeria  2449.008185  3013.976023  2550.816880
 1                    Angola  3520.610273  3827.940465  4269.276742
 2                     Benin  1062.752200   959.601080   949.499064
 3                  Botswana   851.241141   918.232535   983.653976
 4              Burkina Faso   543.255241   617.183465   722.512021
 5                   Burundi   339.296459   379.564628   355.203227
 6                  Cameroon  1172.667655  1313.048099  1399.607441
 7  Central African Republic  1071.310713  1190.844328  1193.068753
 8                      Chad  1178.665927  1308.495577  1389.817618
 9                   Comoros  1102.990936  1211.148548  1406.648278

           2009         2010         2011         2012         2013  \
 0  3246.991771  4182.663766  4910.416756  5745.160213  5681.358539
 1  5522.776375  5473.288005  3008.647355  2756.953672  2430.208311
 2  1035.831411  1085.796879  1029.161251  1277.897616  1225.856010
 3  1214.709294  2263.611114  3214.857818  4551.142150  6205.883850
 4   794.826560   854.735976   743.387037   807.198586   912.063142
 5   412.977514   464.099504   556.103265   559.603231   621.818819
 6  1508.453148  1684.146528  1783.432873  2367.983282  2602.664206
 7  1136.056615  1070.013275  1109.374338   956.752991   844.876350
 8  1196.810565  1104.103987  1133.984950   797.908101   952.386129
 9  1876.029643  1937.577675  1172.603047  1267.100083  1315.980812

           2014         2015          2016          2017
 0  5023.216647  4797.295051   5288.040382   6223.367465
 1  2627.845685  2277.140884   2773.287312   4797.231267
 2  1191.207681  1232.975292   1372.877931   1441.284873
 3  7954.111645  8647.142313  11003.605080  12569.851770
 4   931.752773   946.294962   1037.645221   1217.032994
 5   631.699878   463.115148    446.403513    430.070692
 6  1793.163278  1694.337469   1934.011449   2042.095240
 7   747.905525   740.506332    738.690607    706.016537
 8  1058.064300  1004.961353   1156.181860   1704.063724
 9  1246.907370  1173.618235   1075.811558    986.147879  ,
            country         2006          2007          2008          2009  \
 0      Afghanistan   779.445314    820.853030    853.100710    836.197138
 1          Bahrain  9867.084765  11635.799450  12753.275140  14804.672700
 2       Bangladesh   684.244172    661.637458    686.341554    721.186086
 3         Cambodia   368.469286    434.038336    496.913648    523.432314
 4            China   400.448611    575.987001    487.674018    612.705693
 5  Hong Kong China  3054.421209   3629.076457   4692.648272   6197.962814
 6            India   546.565749    590.061996    658.347151    700.770611
 7        Indonesia   749.681655    858.900271    849.289770    762.431772
 8             Iran  3035.326002   3290.257643   4187.329802   5906.731805
 9             Iraq  4129.766056   6229.333562   8341.737815   8931.459811

            2010          2011          2012          2013          2014  \
 0    739.981106    786.113360    978.011439    852.395945    649.341395
 1  18268.658390  19340.101960  19211.147310  18524.024060  19035.579170
 2    630.233627    659.877232    676.981866    751.979403    837.810164
 3    421.624026    524.972183    624.475478    683.895573    682.303175
 4    676.900092    741.237470    962.421380   1378.904018   1655.784158
 5   8315.928145  11186.141250  14560.530510  20038.472690  24757.603010
 6    724.032527    813.337323    855.723538    976.512676   1164.406809
 7   1111.107907   1382.702056   1516.872988   1748.356961   2383.140898
 8   9613.818607  11888.595080   7608.334602   6642.881371   7235.653188
 9   9576.037596  14688.235070  14517.907110  11643.572680   3745.640687

            2015          2016          2017
 0    635.341351    726.734055    974.580338
 1  20292.016790  23403.559270  29796.048340
 2    972.770035   1136.390430   1391.253792
 3    734.285170    896.226015   1713.778686
 4   2289.234136   3119.280896   4959.114854
 5  28377.632190  30209.015160  39724.978670
 6   1458.817442   1746.769454   2452.210407
 7   3119.335603   2873.912870   3540.651564
 8   8263.590301   9240.761975  11605.714490
 9   3076.239795   4390.717312   4471.061906  ]

In [119]:
len(df_list2)

5

In [120]:
df_final2 = pd.concat(df_list2)

/usr/lib/python3.6/site-packages/IPython/kernel/__main__.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  if __name__ == '__main__':

In [121]:
df_final2.head(15).sort_values(by=["country"])

,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,continent,country
0,1601.056136,1942.284244,2312.888958,2760.196931,3313.422188,3533.003910,3630.880722,3738.932735,2497.437901,3193.054604,4604.211737,5937.029526,NaN,Albania
0,5911.315053,6856.856212,7133.166023,8052.953021,9443.038526,10079.026740,8997.897412,9139.671389,9308.418710,10967.281950,8797.640716,12779.379640,Americas,Argentina
0,10039.595640,10949.649590,12217.226860,14526.124650,16788.629480,18334.197510,19477.009280,21888.889030,23424.766830,26997.936570,30687.754730,34435.367440,NaN,Australia
1,6137.076492,8842.598030,10750.721110,12834.602400,16661.625600,19749.422300,21597.083620,23687.826070,27042.018680,29095.920660,32417.607690,36126.492700,NaN,Austria
2,8343.105127,9714.960623,10991.206760,13149.041190,16672.143560,19117.974480,20979.845890,22525.563080,25575.570690,27561.196630,30485.883750,33692.605080,NaN,Belgium
1,2677.326347,2127.686326,2180.972546,2586.886053,2980.331339,3548.097832,3156.510452,2753.691490,2961.699694,3326.143191,3413.262690,3822.137084,Americas,Bolivia
3,973.533195,1353.989176,1709.683679,2172.352423,2860.169750,3528.481305,4126.613157,4314.114757,2546.781445,4766.355904,6018.975239,7446.298803,NaN,Bosnia and Herzegovina
2,2108.944355,2487.365989,3336.585802,3429.864357,4985.711467,6660.118654,7030.835878,7807.095818,6950.283021,7957.980824,8131.212843,9065.800825,Americas,Brazil
4,2444.286648,3008.670727,4254.337839,5577.002800,6597.494398,7612.240438,8224.191647,8239.854824,6302.623438,5970.388760,7696.777725,10680.792820,NaN,Bulgaria
5,3119.236520,4338.231617,5477.890018,6960.297861,9164.090127,11305.385170,13221.821840,13822.583940,8447.794873,9875.604515,11628.388950,14619.222720,NaN,Croatia
6,6876.140250,8256.343918,10136.867130,11399.444890,13108.453600,14800.160620,15377.228550,16310.443400,14297.021220,16048.514240,17596.210220,22833.308510,NaN,Czech Republic
7,9692.385245,11099.659350,13583.313510,15937.211230,18866.207210,20422.901500,21688.040480,25116.175810,26406.739850,29804.345670,32166.500060,35278.418740,NaN,Denmark
8,6424.519071,7545.415386,9371.842561,10921.636260,14358.875900,15605.422830,18533.157610,21141.012230,20647.164990,23723.950200,28204.590570,33207.084400,NaN,Finland
9,7029.809327,8662.834898,10560.485530,12999.917660,16107.191710,18292.635140,20293.897460,22066.442140,24703.796150,25889.784870,28926.032340,30470.016700,NaN,France
1,10556.575660,12247.395320,13175.678000,14463.918930,16046.037280,16233.717700,17632.410400,19007.191290,18363.324940,21050.413770,23189.801350,25185.009110,NaN,New Zealand

***
***